const defaultState = {
  map: {
    Махачкала: [
      {
        name: "Общая Схема КИРГУ",
        allBuild: true,
        floors: [
          {
            name: "kirgu",
            allBuild: true,
            floor: 1,
            zone: [
              {
                name: "Техника",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Техника", 1],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2465, 390],
                    point: [
                      [-630, 390],
                      [-630, 891],
                      [-2465, 891],
                    ],
                  },
                ],
              },
              {
                name: "Детский",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Детский отдел", 2],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2490, -1230],
                    point: [
                      [-629, -1230],
                      [-629, -605],
                      [-1127, -605],
                      [-1127, -546],
                      [-2000, -546],
                      [-2000, -605],
                      [-2490, -605],
                    ],
                  },
                ],
              },
              {
                name: "Садовый",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Садовый центр", 4],
                props: [
                  {
                    graphics: true,
                    startPoint: [-615, -1225],
                    point: [
                      [266, -1225],
                      [266, 374],
                      [-615, 374],
                    ],
                  },
                ],
              },
              {
                name: "Мебельный корпус",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Мебельный корпус", 3],
                props: [
                  {
                    graphics: true,
                    startPoint: [685, 60],
                    point: [
                      [2723, 60],
                      [2723, 692],
                      [1854, 692],
                      [1854, 805],
                      [1548, 805],
                      [1548, 692],
                      [685, 692],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Техника",
        icon: "electronika",
        floors: [
          {
            name: "tech",
            floor: 0,
            zone: [
              {
                name: "Телевизоры",
                id: "35367728-8121-483e-9318-65e700d9edd1",
                props: [
                  {
                    graphics: true,
                    startPoint: [-940, -320],
                    point: [
                      [2165, -320],
                      [2165, 424],
                      [-940, 424],
                    ],
                  },
                ],
              },
              {
                name: "Игровая зона приставки музыкальные центры ",
                id: "e49d0da4-8da4-4670-a602-c8ece6a4f936",
                allCategory: [
                  {
                    name: "Акустика и аудиосистемы",
                    id: "e49d0da4-8da4-4670-a602-c8ece6a4f936",
                  },
                  {
                    name: "Проекторы",
                    id: "207d0640-c35e-43a1-8981-da1065d62b39",
                  },
                  {
                    name: "Игры",
                    id: "1fbcb707-debf-4c69-934b-2657782402f5",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2160, -315],
                    point: [
                      [-951, -315],
                      [-951, 420],
                      [-1807, 427],
                      [-1807, 850],
                      [-2160, 850],
                    ],
                  },
                ],
              },
              {
                name: "REAL2",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [125, 435],
                    point: [
                      [920, 435],
                      [920, 850],
                      [125, 850],
                    ],
                  },
                ],
              },
              {
                name: "Ноутбуки мониторы моноблоки принтеры",
                id: "eb14daf9-cb58-41f9-9a2d-4fb12a7d20e1",
                allCategory: [
                  {
                    name: "Мониторы",
                    id: "edb61935-a615-44c1-a03c-14cc03df1fcd",
                  },
                  {
                    name: "Ноутбуки",
                    id: "3f54293d-89aa-4d35-97da-2825d2caeb15",
                  },
                  {
                    name: "Принтеры, сканеры, МФУ",
                    id: "57f43d42-8ca8-4fae-93ef-5e55d0c064fa",
                  },
                  {
                    name: "Системные блоки",
                    id: "b0339bed-ef37-4de5-b070-06a047a6129f",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-940, 435],
                    point: [
                      [110, 435],
                      [110, 850],
                      [-940, 850],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "tech",
            floor: 1,
            zone: [
              {
                name: "Реконструкция",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2160, -315],
                    point: [
                      [-940, -315],
                      [-940, -1080],
                      [-766, -1080],
                      [-766, -870],
                      [24, -870],
                      [24, -315],
                      [2170, -315],
                      [2170, 424],
                      [1747, 424],
                      [1747, 856],
                      [-2160, 856],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "tech",
            floor: 2,
            zone: [
              {
                name: "Малая бытовая техника",
                id: "5b14ae51-59f1-4174-9194-06abf6416bfa",
                props: [
                  {
                    graphics: true,
                    startPoint: [-940, -315],
                    point: [
                      [920, -315],
                      [920, 850],
                      [-940, 850],
                    ],
                  },
                ],
              },
              {
                name: "Встраиваемая техника",
                id: "d1638c7d-fc5e-4897-95fa-0e333bb7cc22",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2160, -315],
                    point: [
                      [-955, -315],
                      [-955, 430],
                      [-1810, 430],
                      [-1810, 845],
                      [-2160, 845],
                    ],
                  },
                ],
              },
              {
                name: "Пылесосы товары для уборки",
                id: "946e5e91-5bf7-49b3-bcf3-712868f08dce",
                props: [
                  {
                    graphics: true,
                    startPoint: [935, -315],
                    point: [
                      [2165, -315],
                      [2165, 420],
                      [935, 420],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "tech",
            floor: 3,
            zone: [
              {
                name: "Холодильники лари морозильники",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                props: [
                  {
                    graphics: true,
                    startPoint: [-940, -315],
                    point: [
                      [2165, -315],
                      [2165, 430],
                      [-940, 430],
                    ],
                  },
                ],
              },
              {
                name: "Климатическое оборудование",
                id: "b6a9659a-32b0-4bd8-b3d1-add9e17d5c9d",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2160, -315],
                    point: [
                      [-955, -315],
                      [-955, 430],
                      [-1810, 430],
                      [-1810, 845],
                      [-2160, 845],
                    ],
                  },
                ],
              },
              {
                name: "Стиральные и сушильные машины",
                id: "933dff91-d9bb-452f-a71e-c3b716c4a96f",
                props: [
                  {
                    graphics: true,
                    startPoint: [-940, 440],
                    point: [
                      [920, 440],
                      [920, 850],
                      [-940, 850],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Детский отдел",
        floors: [
          {
            name: "kids",
            floor: 0,

            zone: [
              {
                name: "Дисконт центр",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2555, -925],
                    point: [
                      [2555, -925],
                      [2555, 795],
                      [1750, 795],
                      [1750, 165],
                      [1214, 165],
                      [1214, 795],
                      [-1214, 795],
                      [-1214, 165],
                      [-1750, 165],
                      [-1750, 795],
                      [-2555, 795],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "kids",
            floor: 1,
            zone: [
              {
                name: "Одежда для девочек",
                id: "715bd8d0-58c0-4e62-ac80-19eae22d768e",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1750, -1030],
                    point: [
                      [-754, -1030],
                      [-754, -650],
                      [-1750, -650],
                    ],
                  },
                ],
              },
              {
                name: "Обувь",
                id: "7e2f41ff-d54e-4254-a50c-061dbb68e6cc",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2550, -1030],
                    point: [
                      [-1760, -1030],
                      [-1760, 215],
                      [-2550, 215],
                    ],
                  },
                ],
              },
              {
                name: "Промо Зона",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1750, -640],
                    point: [
                      [1740, -640],
                      [1740, -185],
                      [-1750, -185],
                    ],
                  },
                ],
              },
              {
                name: "Одежда для мальчиков",
                id: "715bd8d0-58c0-4e62-ac80-19eae22d768e",
                props: [
                  {
                    graphics: true,
                    startPoint: [745, -1030],
                    point: [
                      [1740, -1030],
                      [1740, -650],
                      [745, -650],
                    ],
                  },
                ],
              },
              {
                name: "Игрушки для мальчиков",
                id: "68dccf2a-eb96-4ebd-8108-3c710a7d6ab6",
                props: [
                  {
                    graphics: true,
                    startPoint: [205, -170],
                    point: [
                      [1205, -170],
                      [1205, 220],
                      [205, 220],
                    ],
                  },
                ],
              },
              {
                name: "Игрушки для девочек",
                id: "68dccf2a-eb96-4ebd-8108-3c710a7d6ab6",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1205, -170],
                    point: [
                      [-210, -170],
                      [-210, 220],
                      [-1205, 220],
                    ],
                  },
                ],
              },
              {
                name: "Одежда и обувь для новорожденных",
                id: "59b884f9-f518-463d-aef2-bafbcd08d281",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1205, 235],
                    point: [
                      [-210, 235],
                      [-210, 600],
                      [-610, 600],
                      [-610, 705],
                      [-1205, 705],
                    ],
                  },
                ],
              },
              {
                name: "Концтовары",
                id: "3ae21c55-f9cc-4820-9189-dc7292c4158b",
                props: [
                  {
                    graphics: true,
                    startPoint: [205, 235],
                    point: [
                      [1205, 235],
                      [1205, 705],
                      [205, 705],
                    ],
                  },
                ],
              },
              {
                name: "Коляски и автокресла спорт и активный отдых",
                id: "285b7347-7415-4b99-b786-78d68c21dea8",
                allCategory: [
                  {
                    name: "Коляски и автокресла",
                    id: "285b7347-7415-4b99-b786-78d68c21dea8",
                  },
                  {
                    name: "Спорт и активный отдых",
                    id: "c0c717f1-6288-4d37-8252-b32cdce681d9",
                  },
                  {
                    name: "Игрушки",
                    id: "68dccf2a-eb96-4ebd-8108-3c710a7d6ab6",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [1755, -1030],
                    point: [
                      [2550, -1030],
                      [2550, 215],
                      [1755, 215],
                    ],
                  },
                ],
              },
              {
                name: "Mayoral",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-740, -1030],
                    point: [
                      [730, -1030],
                      [730, -650],
                      [-740, -650],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Мебельный корпус",
        icon: "mebel",
        floors: [
          {
            name: "mebel",
            floor: 0,
            zone: [
              {
                name: "Офисная мебель, предметы интерьера",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                allCategory: [
                  {
                    name: "Офисная мебель",
                    id: "58889bd9-f77d-4d78-80bc-82c9746168d0",
                  },
                  {
                    name: "Предметы интерьера",
                    id: "fed4d9b1-89d9-46b4-92c5-05e2095561ae",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2522, -690],
                    point: [
                      [-421, -690],
                      [-421, 873],
                      [-1305, 873],
                      [-1305, 375],
                      [-1655, 375],
                      [-1655, 516],
                      [-1935, 516],
                      [-1929, 870],
                      [-2522, 870],
                    ],
                  },
                ],
              },
              {
                name: "Столовая",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                props: [
                  {
                    graphics: true,
                    startPoint: [1937, -70],
                    point: [
                      [2521, -70],
                      [2521, 867],
                      [1937, 867],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 1,

            zone: [
              {
                name: "Текстиль",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2530, -545],
                    point: [
                      [-1555, -545],
                      [-1555, 285],
                      [-1925, 285],
                      [-1925, 645],
                      [-2530, 645],
                    ],
                  },
                ],
              },
              {
                name: "Клеенки корзины сушилки пластик",
                id: "0686859a-c54a-46a3-aa4e-f0b8784ececf",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1535, -920],
                    point: [
                      [-460, -920],
                      [-460, 115],
                      [-925, 115],
                      [-925, -10],
                      [-1280, -10],
                      [-1280, 115],
                      [-1535, 115],
                    ],
                  },
                ],
              },
              {
                name: "Бытовая химия",
                id: "360e746a-10d6-412a-a022-d2fd8b8c1e80",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1325, 300],
                    point: [
                      [-500, 300],
                      [-500, 640],
                      [-1325, 640],
                    ],
                  },
                ],
              },
              {
                name: "Арома",
                id: "790b0b5a-c584-4b0b-a718-66b45d317b41",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2200, -920],
                    point: [
                      [-1920, -920],
                      [-1920, -565],
                      [-2200, -565],
                    ],
                  },
                ],
              },
              {
                name: "Сувенир",
                id: "e3d1154f-3756-4348-a7a0-999b90c56929",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1910, -920],
                    point: [
                      [-1545, -920],
                      [-1545, -565],
                      [-1910, -565],
                    ],
                  },
                ],
              },
              {
                name: "Сковородки",
                id: "ee318362-ad72-468a-92b9-66de67bc741f",
                props: [
                  {
                    graphics: true,
                    startPoint: [-450, -555],
                    point: [
                      [455, -555],
                      [455, -445],
                      [-450, -445],
                    ],
                  },
                ],
              },
              {
                name: "Кастрюли посуда для сервировки",
                id: "67168837-3e29-4fab-8a13-51bb45eefe35",
                allCategory: [
                  {
                    name: "Кастрюли",
                    id: "97e76780-3323-4c30-95c6-0c1b36f8c0d0",
                  },
                  {
                    name: "Посуда для сервировки",
                    id: "67168837-3e29-4fab-8a13-51bb45eefe35",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [468, -920],
                    point: [
                      [1920, -920],
                      [1920, -565],
                      [468, -565],
                    ],
                  },
                ],
              },
              {
                name: "Кухонная утварь тарелки кастрюли чайники",
                id: "531e96d5-9c30-4b4c-823d-e91792a37f07",
                allCategory: [
                  {
                    name: "Посуда для приготовления пищи",
                    id: "e1e1b734-1fd4-4d63-b34d-f894b5837ad0",
                  },
                  {
                    name: "Столовая посуда",
                    id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                  },
                  {
                    name: "Чайники",
                    id: "fef45bb6-2b0a-41f4-b8a4-ad6cb4d1281a",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [470, -555],
                    point: [
                      [1919, -555],
                      [1919, 115],
                      [1280, 115],
                      [1280, -8],
                      [923, -8],
                      [923, 115],
                      [469, 115],
                    ],
                  },
                ],
              },
              {
                name: "Хрусталь",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                props: [
                  {
                    graphics: true,
                    startPoint: [1935, -920],
                    point: [
                      [2520, -920],
                      [2520, -220],
                      [2205, -220],
                      [2205, -340],
                      [1935, -340],
                    ],
                  },
                ],
              },
              {
                name: "Фарфор",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [1935, -210],
                    point: [
                      [2520, -210],
                      [2520, 640],
                      [1937, 640],
                      [1937, 400],
                      [2216, 400],
                      [2216, 290],
                      [1935, 290],
                    ],
                  },
                ],
              },
              {
                name: "Премиальный бутик",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [800, 300],
                    point: [
                      [1307, 300],
                      [1307, 640],
                      [800, 640],
                    ],
                  },
                ],
              },
              {
                name: "Аптека",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [495, 300],
                    point: [
                      [790, 300],
                      [790, 640],
                      [495, 640],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 2,

            zone: [
              {
                name: "Мягкая мебель журнальные столики спальни",
                id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                allCategory: [
                  {
                    name: "Мягкая мебель",
                    id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                  },
                  {
                    name: "Спальни",
                    id: "874ec115-a252-4b86-a881-d334a9cbcf25",
                  },
                  {
                    name: "Журнальные столики",
                    id: "61e91c57-ceea-428b-bdcd-eda54d6b3c92",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2520, -835],
                    point: [
                      [-470, -835],
                      [-470, -466],
                      [466, -466],
                      [466, -835],
                      [2520, -835],
                      [2520, 727],
                      [1935, 727],
                      [1935, 365],
                      [1305, 365],
                      [1305, 727],
                      [-1305, 727],
                      [-1305, 365],
                      [-1935, 365],
                      [-1935, 727],
                      [-2520, 727],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 3,

            zone: [
              {
                name: "Мягкая мебель, осветительные приборы",
                id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                allCategory: [
                  {
                    name: "Мягкая мебель",
                    id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                  },
                  {
                    name: "Осветительные приборы",
                    id: "d8ba24a4-b3f1-42b8-a2bd-ee6c88237d0a",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-1613, -358],
                    point: [
                      [1936, -358],
                      [1936, 469],
                      [-1613, 469],
                    ],
                  },
                ],
              },
              {
                name: "Ковры",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2505, -358],
                    point: [
                      [-1625, -358],
                      [-1625, 470],
                      [-2505, 470],
                    ],
                  },
                ],
              },
              {
                name: "Шторы",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2505, -725],
                    point: [
                      [-1625, -725],
                      [-1625, -375],
                      [-2505, -375],
                    ],
                  },
                ],
              },
              {
                name: "Картины часы зеркала",
                id: "fed4d9b1-89d9-46b4-92c5-05e2095561ae",
                allCategory: [
                  {
                    name: "Картины",
                    id: "c25a3f2b-b519-4e46-b3c9-049152235eea",
                  },
                  {
                    name: "Часы",
                    id: "bcfbcc67-975a-4a9c-97e2-7a1eaff86760",
                  },
                  {
                    name: "Зеркала",
                    id: "bf274d1d-3ed1-4621-8d9f-3a2c6d9af49c",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-1615, -725],
                    point: [
                      [-450, -725],
                      [-450, -375],
                      [-1615, -375],
                    ],
                  },
                ],
              },
              {
                name: "Шкафы",
                id: "af89a980-30a1-43dc-87e3-dbb1ccce8b09",
                props: [
                  {
                    graphics: true,
                    startPoint: [485, -725],
                    point: [
                      [1935, -725],
                      [1935, -375],
                      [485, -375],
                    ],
                  },
                ],
              },
              {
                name: "Кровати",
                id: "324dba8c-431e-44b4-87b5-831543844040",
                props: [
                  {
                    graphics: true,
                    startPoint: [1950, -725],
                    point: [
                      [2535, -725],
                      [2535, -125],
                      [1950, -125],
                    ],
                  },
                ],
              },
              {
                name: "Прихожие",
                id: "ac76f3d3-fe9c-4db5-93f9-6c23786f52b3",
                props: [
                  {
                    graphics: true,
                    startPoint: [1950, -115],
                    point: [
                      [2535, -115],
                      [2535, 470],
                      [1950, 470],
                    ],
                  },
                ],
              },
              {
                name: "Комоды",
                id: "8c5e0ae3-13e2-4163-a77c-413b18ca8149",
                props: [
                  {
                    graphics: true,
                    startPoint: [1950, 485],
                    point: [
                      [2535, 485],
                      [2535, 835],
                      [1950, 835],
                    ],
                  },
                ],
              },
              {
                name: "Кресла прихожие",
                id: "6ce154d3-b975-40c5-8940-625d80e8c388",
                allCategory: [
                  {
                    name: "Кресла прихожие",
                    id: "6ce154d3-b975-40c5-8940-625d80e8c388",
                  },
                  {
                    name: "Прихожие",
                    id: "ac76f3d3-fe9c-4db5-93f9-6c23786f52b3",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [165, 485],
                    point: [
                      [1320, 485],
                      [1320, 830],
                      [165, 830],
                    ],
                  },
                ],
              },
              {
                name: "Часы, камины, бра",
                id: "fed4d9b1-89d9-46b4-92c5-05e2095561ae",
                allCategory: [
                  {
                    name: "Часы",
                    id: "bcfbcc67-975a-4a9c-97e2-7a1eaff86760",
                  },
                  {
                    name: "Камины",
                    id: "62c23491-421d-432b-919e-ffadf566793e",
                  },
                  {
                    name: "Бра	",
                    id: "90995a16-99da-4f85-901c-1d09f352ec45",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-1290, 485],
                    point: [
                      [-345, 485],
                      [-345, 830],
                      [-1290, 830],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 4,
            zone: [
              {
                name: "Кухонная мебель столы и стулья",
                id: "b3133753-8df7-4d84-b72c-25140dd903c7",
                allCategory: [
                  {
                    name: "Кухонная мебель",
                    id: "b3133753-8df7-4d84-b72c-25140dd903c7",
                  },
                  {
                    name: "Столы и стулья",
                    id: "9d3c3502-4fba-436f-9997-7e4df3adecfe",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2520, -830],
                    point: [
                      [-470, -830],
                      [-470, -465],
                      [470, -465],
                      [470, -830],
                      [1305, -830],
                      [1305, 365],
                      [-1940, 365],
                      [-1940, 732],
                      [-2520, 732],
                    ],
                  },
                ],
              },
              {
                name: "Детская мебель",
                id: "2842fb99-2467-40b3-afdb-52130ec79b2c",
                props: [
                  {
                    graphics: true,
                    startPoint: [1320, -830],
                    point: [
                      [2520, -830],
                      [2520, 730],
                      [1935, 730],
                      [1935, 365],
                      [1320, 365],
                    ],
                  },
                ],
              },
              {
                name: "Кухни",
                id: "834e7a61-560f-4a09-8e29-ed725cdd3e61",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1040, 378],
                    point: [
                      [-365, 378],
                      [-365, 725],
                      [-1040, 725],
                    ],
                  },
                ],
              },
              {
                name: "Кухни столы",
                id: "fd5412c8-947a-4c11-bd75-317d3ec33713",
                props: [
                  {
                    graphics: true,
                    startPoint: [150, 378],
                    point: [
                      [1305, 378],
                      [1305, 725],
                      [150, 725],
                    ],
                  },
                ],
              },
              {
                name: "Акссесуары для кухни",
                id: "64457d00-db85-4a84-aed7-1bb435acdcdf",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1305, 378],
                    point: [
                      [-1050, 378],
                      [-1050, 725],
                      [-1305, 725],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 5,

            zone: [
              {
                name: "Импортная мебель",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2525, -835],
                    point: [
                      [-465, -835],
                      [-465, -470],
                      [466, -470],
                      [466, -835],
                      [2525, -835],
                      [2525, 730],
                      [1930, 730],
                      [1930, 370],
                      [1310, 370],
                      [1310, 730],
                      [-1310, 730],
                      [-1310, 370],
                      [-1930, 370],
                      [-1930, 730],
                      [-2525, 730],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },
      
      {
        name: "Садовый центр",
        floors: [
          {
            name: "garden",
            floor: 0,
            id: ["ef66b2f0-d8aa-4b73-b6e1-9ae4e8c2cbf0"],
            zone: [
              {
                name: "Садовая мебель",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1560, -780],
                    point: [
                      [1555, -780],
                      [1555, 940],
                      [-1560, 940],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "garden",
            floor: 1,
            zone: [
              {
                name: "Всё для растений товары для отдыха и полива ландшафт",
                id: "5f794cd1-33f8-448b-9bab-6da2e89a19aa",
                allCategory: [
                  {
                    name: "Всё для растений",
                    id: "5f794cd1-33f8-448b-9bab-6da2e89a19aa",
                  },
                  {
                    name: "Товары для отдыха",
                    id: "a59be78c-b332-4e20-888b-3eaa02d40bc6",
                  },
                  {
                    name: "Товары для полива",
                    id: "2af2d71c-41a1-4b45-a5a6-10f6b0e5af17",
                  },
                  {
                    name: "Ландшафт и садовый декор",
                    id: "77cb9871-127d-4ee3-933f-d0f08000e295",
                  },
                  {
                    name: "Садовая техника",
                    id: "0d5e8ec5-1a34-4ae1-a088-54be396e37e2",
                  },
                  {
                    name: "Садовый инструмент",
                    id: "3cb746b9-6ed9-4364-8db9-e650e91adea8",
                  },
                  {
                    name: "Садовый инвентарь",
                    id: "ea0a2c1a-5f5c-4d4f-add6-caa8941bfc82",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-1560, -965],
                    point: [
                      [7, -965],
                      [7, 750],
                      [-1560, 750],
                    ],
                  },
                ],
              },
              {
                name: "Удобрение газон семена земляцветы горшоки",
                id: "ba427b61-5c73-4e9e-aad5-58f83b26a821",
                props: [
                  {
                    graphics: true,
                    startPoint: [25, -965],
                    point: [
                      [1555, -965],
                      [1555, 750],
                      [25, 750],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },
    ],

    Дербент: [
      {
        name: "Дербент",
        floors: [
          {
            name: "derbent",
            floor: 0,
            zone: [
              {
                name: "Печи",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-650, -170],
                    point: [
                      [-60, -170],
                      [-60, 165],
                      [-650, 165],
                    ],
                  },
                ],
              },
              {
                name: "Малая бытовая техника",
                id: "5b14ae51-59f1-4174-9194-06abf6416bfa",
                props: [
                  {
                    graphics: true,
                    startPoint: [-45, -170],
                    point: [
                      [535, -170],
                      [535, 165],
                      [-45, 165],
                    ],
                  },
                ],
              },
              {
                name: "Встраиваемая техника",
                id: "d1638c7d-fc5e-4897-95fa-0e333bb7cc22",
                props: [
                  {
                    graphics: true,
                    startPoint: [38, -480],
                    point: [
                      [525, -480],
                      [525, -180],
                      [38, -180],
                    ],
                  },
                ],
              },
              {
                name: "Климатическое оборудование",
                id: "b6a9659a-32b0-4bd8-b3d1-add9e17d5c9d",
                props: [
                  {
                    graphics: true,
                    startPoint: [-470, -480],
                    point: [
                      [18, -480],
                      [18, -180],
                      [-470, -180],
                    ],
                  },
                ],
              },
              {
                name: "Стиральные и сушильные машины",
                id: "933dff91-d9bb-452f-a71e-c3b716c4a96f",
                props: [
                  {
                    graphics: true,
                    startPoint: [-975, -480],
                    point: [
                      [-480, -480],
                      [-480, -180],
                      [-660, -180],
                      [-660, 0],
                      [-975, 0],
                    ],
                  },
                ],
              },
              {
                name: "Холодильники лари морозильники",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                props: [
                  {
                    graphics: true,
                    startPoint: [-975, 15],
                    point: [
                      [-660, 15],
                      [-660, 180],
                      [-280, 180],
                      [-280, 475],
                      [-975, 475],
                    ],
                  },
                ],
              },
              {
                name: "Электроника",
                id: "7e59ab9a-9932-4535-b780-860c8a6d325e",
                props: [
                  {
                    graphics: true,
                    startPoint: [550, -485],
                    point: [
                      [980, -485],
                      [980, 475],
                      [340, 475],
                      [340, 175],
                      [550, 175],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "derbent",
            floor: 1,
            zone: [
              {
                name: "Детский отдел",
                id: "31b73b4b-f098-4f96-a967-233760a0e426",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1255, -1308 ],
                    point: [
                      [ 1205, -1308 ],
                      [ 1165, -675 ],
                      [ 610, -675 ],
                      [ 610, -851 ],
                      [ -1255, -851 ],
                    ],
                  },
                ],
              },
              {
                name: "Текстиль",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                props: [
                  {
                    graphics: true,
                    startPoint: [ 615, -655 ],
                    point: [
                      [ 1161, -655 ],
                      [ 1077, 678 ],
                      [ 343, 678 ],
                      [ 343, 385 ],
                      [ 615, 385 ],
                    ],
                  },
                ],
              },
              {
                name: "Красота и здоровье",
                id: "7cc46fb9-f575-4e80-b434-c93b4bb81fac",
                props: [
                  {
                    graphics: true,
                    startPoint: [ 873, 690 ],
                    point: [
                      [ 1076, 690 ],
                      [ 1034, 1330 ],
                      [ 577, 1330 ],
                      [ 577, 1045 ],
                      [ 873, 1045 ],
                    ],
                  },
                ],
              },
              {
                name: "Лабиринт",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [-1768, -1300],
                    point: [
                      [-1280, -1300],
                      [-1280, -850],
                      [-1768, -850],
                    ],
                  },
                ],
              },
              {
                name: "Сервис-сити",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1770, 380 ],
                    point: [  
                      [ -1410, 380 ],
                      [ -1410, 1330 ],
                      [ -1770, 1330 ],
                    ],
                  },
                ],
              },
              {
                name: "Сковородки",
                id: "ee318362-ad72-468a-92b9-66de67bc741f",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -665, 385 ],
                    point: [
                      [ -170, 385 ],
                      [ -170, 675 ],
                      [ -665, 675 ],
                    ],
                  },
                ],
              },
              {
                name: "Нержавейка",
                id: "e1e1b734-1fd4-4d63-b34d-f894b5837ad0",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -160, 385 ],
                    point: [
                      [ 330, 385 ],
                      [ 330, 675 ],
                      [ -160, 675 ],
                    ],
                  },
                ],
              },
              {
                name: "Хрусталь, стекло",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1375, 380 ],
                    point: [
                      [ -678, 380 ],
                      [ -678, 674 ],
                      [ -1059, 674 ],
                      [ -1059, 865 ],
                      [ -1375, 865 ],
                    ],
                  },
                ],
              },
              {
                name: "Фарфор",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1375, 880 ],
                    point: [
                      [ -1059, 880 ],
                      [ -1059, 1040 ],
                      [ -682, 1040 ],
                      [ -682, 1335 ],
                      [ -1375, 1335 ],
                    ],
                  },
                ],
              },
              {
                name: "Цветы, сувенирка",
                id: "e3d1154f-3756-4348-a7a0-999b90c56929",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -65, 1105 ],
                    point: [
                      [ 125, 1105 ],
                      [ 125, 1040 ],
                      [ 555, 1040 ],
                      [ 555, 1330 ],
                      [ 125, 1330 ],
                      [ 125, 1295 ],
                      [ -65, 1295 ],
                    ],
                  },
                ],
              },
              {
                name: "Эмаль, пластик, керамика",
                id: "",
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1045, 690 ],
                    point: [
                      [ 850, 690 ],
                      [ 850, 1024 ],
                      [ -1045, 1024 ],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "derbent",
            floor: 2,
            zone: [
              {
                name: "Мягкая мебель, журнальные столики, спальни ...",
                id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                allCategory: [
                  {
                    name: "Мягкая мебель",
                    id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                  },
                  {
                    name: "Журнальные столики",
                    id: "61e91c57-ceea-428b-bdcd-eda54d6b3c92",
                  },
                  {
                    name: "Спальни",
                    id: "874ec115-a252-4b86-a881-d334a9cbcf25",
                  },
                  {
                    name: "Осветительные приборы",
                    id: "d8ba24a4-b3f1-42b8-a2bd-ee6c88237d0a",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1096, 365 ],
                    point: [
                      [ 862, 365 ],
                      [ 862, 1320 ],
                      [ 240, 1320 ],
                      [ 240, 1014 ],
                      [ -397, 1014 ],
                      [ -397, 1320 ],
                      [ -1096, 1320 ],
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: "derbent",
            floor: 3,
            zone: [
              {
                name: "Столовые группы, кухни",
                id: "9d3c3502-4fba-436f-9997-7e4df3adecfe",
                allCategory: [
                  {
                    name: "Столовые группы",
                    id: "9d3c3502-4fba-436f-9997-7e4df3adecfe",
                  },
                  {
                    name: "Кухни",
                    id: "834e7a61-560f-4a09-8e29-ed725cdd3e61",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [ -1098, 445 ],
                    point: [
                      [ 863, 445 ],
                      [ 863, 1405 ],
                      [ 235, 1405 ],
                      [ 235, 1100 ],
                      [ -399, 1100 ],
                      [ -399, 1405 ],
                      [ -1098, 1405 ],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },
    ],

    Каспийск: [
      {
        name: "Капийск КИРГУ",
        floors: [
          {
            name: "kaspiyskKirgu",
            floor: 1,
            zone: [
              {
                name: "Товары для дома, столовая посуда ...",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                props: [
                  {
                    graphics: true,
                    startPoint: [30, -380],
                    point: [
                      [2530, -380],
                      [2530, 355],
                      [30, 355],
                      [30, 130],
                      [323, 130],
                      [325, 15],
                      [30, 15],
                    ],
                  },
                ],
              },
              {
                name: "Крупная и малая бытовая техника",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                allCategory: [
                  {
                    name: "Крупная бытовая техника",
                    id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                  },
                  {
                    name: "Малая бытовая техника",
                    id: "5b14ae51-59f1-4174-9194-06abf6416bfa",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-1710, -380],
                    point: [
                      [-400, -380],
                      [-400, 355],
                      [-1710, 355],
                    ],
                  },
                ],
              },
              {
                name: "Товары для ухода за одеждой и домом",
                id: "360e746a-10d6-412a-a022-d2fd8b8c1e80",
                props: [
                  {
                    graphics: true,
                    startPoint: [-2300, 135],
                    point: [
                      [-1720, 135],
                      [-1720, 355],
                      [-2300, 355],
                    ],
                  },
                ],
              },
              {
                name: "Электоника, климатическое оборудование",
                id: "7e59ab9a-9932-4535-b780-860c8a6d325e",
                allCategory: [
                  {
                    name: "Электоника",
                    id: "7e59ab9a-9932-4535-b780-860c8a6d325e",
                  },
                  {
                    name: "Климатическое оборудование",
                    id: "b6a9659a-32b0-4bd8-b3d1-add9e17d5c9d",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-2530, -380],
                    point: [
                      [-1720, -380],
                      [-1720, 125],
                      [-2315, 125],
                      [-2315, 355],
                      [-2530, 355],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },
      {
        name: "Каспийск Домашний",
        floors: [
          {
            name: "kaspiyskHome",
            floor: 1,
            zone: [
              {
                name: "Хрусталь, стекло, химия, текстиль, пластика",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                allCategory: [
                  {
                    name: "Хрусталь",
                    id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                  },
                  {
                    name: "Химия",
                    id: "360e746a-10d6-412a-a022-d2fd8b8c1e80",
                  },
                  {
                    name: "Текстиль",
                    id: "97c06658-eab4-450c-8502-b4391fa2f359",
                  },
                  {
                    name: "Пластика",
                    id: "9d65bc7ef-55ab-4a1b-bf47-9106a1e11f7f",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [68, -376],
                    point: [
                      [880, -390],
                      [877, 405],
                      [1550, 412],
                      [1550, -390],
                      [1930, -390],
                      [1930, 777],
                      [1198, 785],
                      [1200, 1190],
                      [-370, 1190],
                      [-362, 1044],
                      [-810, 1039],
                      [-810, 525],
                      [-308, 524],
                      [-309, 170],
                      [70, -155],
                    ],
                  },
                ],
              },
              {
                name: "Хрусталь, фарфор, текстиль, пластика",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                allCategory: [
                  {
                    name: "Фарфор",
                    id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                  },
                  {
                    name: "Эмаль",
                    id: "97c06658-eab4-450c-8502-b4391fa2f359",
                  },
                  {
                    name: "Нержавейка",
                    id: "e1e1b734-1fd4-4d63-b34d-f894b5837ad0",
                  },
                ],
                props: [
                  {
                    graphics: true,
                    startPoint: [-1930, -1190],
                    point: [
                      [-341, -1190],
                      [-340, -750],
                      [37, -380],
                      [41, -161],
                      [-336, 165],
                      [-336, 500],
                      [-839, 500],
                      [-840, 1190],
                      [-1269, 1190],
                      [-1929, 520],
                      [-1928, 110],
                      [-1773, 110],
                      [-1774, -351],
                      [-1930, -355],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },
    ],

    Махачкала_: [
      {
        name: "Махачкала_Диджитал",
        floors: [
          {
            name: "makhachkalaDigital",
            floor: 1,
            zone: [
              {
                name: "Бытовая химия, столовые приборы, нержавейка ...",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                props: [
                  {
                    graphics: true,
                    startPoint: [-770, -815],
                    point: [
                      [220, -815],
                      [250, 80],
                      [-770, 80],
                    ],
                  },
                ],
              },
              {
                name: "Пластмасса, хрусталь",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                props: [
                  {
                    graphics: true,
                    startPoint: [-770, 90],
                    point: [
                      [250, 104],
                      [270, 670],
                      [-350, 670],
                      [-770, 500],
                    ],
                  },
                ],
              },
            ],
          },
        ].reverse(),
      },
    ],
  },
};

const BUILDING = "BUILDING";

export const buildingMapReducer = (state = defaultState, action) => {
  switch (action.type) {
    default:
      return state;
  }
};
