const defaultState = {
  map: {
    Махачкала: [
      {
        name: "Общая Схема КИРГУ",
        allBuild: true,
        floors: [
          {
            name: "kirgu",
            allBuild: true,
            floor: 1,
            zone: [
              {
                name: "Техника",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Техника", 1],
                point: [
                  [98, 682],
                  [740, 682],
                  [740, 856],
                  [98, 856],
                ],
              },
              {
                name: "Детский",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Детский отдел", 2],
                point: [
                  [87, 116],
                  [740, 116],
                  [740, 335],
                  [568, 335],
                  [568, 359],
                  [260, 359],
                  [260, 335],
                  [87, 335],
                ],
              },
              {
                name: "Садовый",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Садовый центр", 4],
                point: [
                  [746, 116],
                  [1055, 116],
                  [1055, 677],
                  [746, 677],
                ],
              },
              {
                name: "Мебельный корпус",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                build: ["Мебельный корпус", 3],
                point: [
                  [1201, 566],
                  [1913, 566],
                  [1913, 790],
                  [1610, 790],
                  [1610, 829],
                  [1500, 829],
                  [1500, 790],
                  [1201, 790],
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Техника",
        icon: "electronika",
        floors: [
          {
            name: "tech",
            floor: 0,
            zone: [
              {
                name: "Телевизоры",
                id: "35367728-8121-483e-9318-65e700d9edd1",
                point: [
                  [551, 408],
                  [1903, 408],
                  [1903, 730],
                  [551, 730],
                ],
              },
              {
                name: "Игровая зона приставки музыкальные центры ",
                id: "e49d0da4-8da4-4670-a602-c8ece6a4f936",
                allCategory: [
                  {
                    name: "Акустика и аудиосистемы",
                    id: "e49d0da4-8da4-4670-a602-c8ece6a4f936",
                  },
                  {
                    name: "Проекторы",
                    id: "207d0640-c35e-43a1-8981-da1065d62b39",
                  },
                  {
                    name: "Игры",
                    id: "1fbcb707-debf-4c69-934b-2657782402f5",
                  },
                ],
                point: [
                  [19, 408],
                  [545, 408],
                  [545, 730],
                  [172, 730],
                  [172, 917],
                  [19, 917],
                ],
              },
              {
                name: "REAL2",
                id: "",
                point: [
                  [1016, 735],
                  [1362, 735],
                  [1362, 916],
                  [1016, 916],
                ],
              },
              {
                name: "Ноутбуки мониторы моноблоки принтеры",
                id: "eb14daf9-cb58-41f9-9a2d-4fb12a7d20e1",
                allCategory: [
                  {
                    name: "Мониторы",
                    id: "edb61935-a615-44c1-a03c-14cc03df1fcd",
                  },
                  {
                    name: "Ноутбуки",
                    id: "3f54293d-89aa-4d35-97da-2825d2caeb15",
                  },
                  {
                    name: "Принтеры, сканеры, МФУ",
                    id: "57f43d42-8ca8-4fae-93ef-5e55d0c064fa",
                  },
                  {
                    name: "Системные блоки",
                    id: "b0339bed-ef37-4de5-b070-06a047a6129f",
                  },
                ],
                point: [
                  [550, 735],
                  [1008, 735],
                  [1008, 916],
                  [550, 916],
                ],
              },
            ],
          },
          {
            name: "tech",
            floor: 1,
            zone: [
              {
                name: "Малая бытовая техника",
                id: "5b14ae51-59f1-4174-9194-06abf6416bfa",
                point: [
                  [19, 408],
                  [1722, 408],
                  [1722, 730],
                  [1360, 730],
                  [1360, 916],
                  [558, 916],
                  [558, 730],
                  [19, 730],
                ],
              },
              {
                name: "BORK",
                point: [
                  [265, 168],
                  [535, 168],
                  [535, 393],
                  [265, 393],
                ],
              },
              {
                name: "KENWOOD",
                point: [
                  [18, 736],
                  [172, 736],
                  [172, 918],
                  [18, 918],
                ],
              },
              {
                name: "KITCHENAID",
                point: [
                  [17, 168],
                  [260, 168],
                  [260, 393],
                  [17, 393],
                ],
              },
            ],
          },
          {
            name: "tech",
            floor: 2,
            zone: [
              {
                name: "Печи соло, стиральные машины, встраиваемая техника",
                allCategory: [
                  {
                    name: "Стиральные машины",
                    id: "e229bf89-f176-474d-885d-4301043f8691",
                  },
                  {
                    name: "Встраиваемая техника",
                    id: "d1638c7d-fc5e-4897-95fa-0e333bb7cc22",
                  },
                  {
                    name: "Варочные панели",
                    id: "47957330-1d6e-47de-82a1-0205bbf1bd1e",
                  },
                  {
                    name: "Духовые шкафы",
                    id: "774ffab5-2afb-4d8e-b9da-44c021536cbf",
                  },
                  {
                    name: "Вытяжки",
                    id: "1dd6bb92-d739-474d-8178-5f6fa30e795e",
                  },
                ],
                point: [
                  [549, 406],
                  [1907, 406],
                  [1907, 735],
                  [1363, 735],
                  [1363, 920],
                  [549, 920],
                ],
              },
              {
                name: "Отдел климата",
                id: "b6a9659a-32b0-4bd8-b3d1-add9e17d5c9d",
                point: [
                  [17, 406],
                  [544, 406],
                  [544, 735],
                  [174, 735],
                  [174, 921],
                  [17, 921],
                ],
              },
            ],
          },
          {
            name: "tech",
            floor: 3,
            zone: [
              {
                name: "Холодильники, лари",
                id: "dac74be0-34b5-46e1-809f-3cf2eb2179ed",
                point: [
                  [16, 408],
                  [1905, 408],
                  [1905, 732],
                  [1365, 732],
                  [1365, 918],
                  [550, 918],
                  [550, 736],
                  [173, 736],
                  [173, 919],
                  [16, 919],
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Детский отдел",
        floors: [
          {
            name: "kids",
            floor: 0,

            zone: [
              {
                name: "Дисконт центр",
                id: "",
                point: [
                  [12, 236],
                  [1906, 236],
                  [1906, 824],
                  [1611, 824],
                  [1608, 610],
                  [1409, 610],
                  [1409, 886],
                  [512, 886],
                  [512, 610],
                  [311, 610],
                  [311, 670],
                  [12, 670],
                ],
              },
            ],
          },
          {
            name: "kids",
            floor: 1,
            zone: [
              {
                name: "Одежда для девочек",
                id: "715bd8d0-58c0-4e62-ac80-19eae22d768e",
                point: [
                  [315, 237],
                  [684, 237],
                  [684, 368],
                  [315, 368],
                ],
              },
              {
                name: "Mayoral",
                id: "",
                point: [
                  [688, 237],
                  [1232, 237],
                  [1232, 368],
                  [688, 368],
                ],
              },
              {
                name: "Одежда для мальчиков",
                id: "715bd8d0-58c0-4e62-ac80-19eae22d768e",
                point: [
                  [1236, 237],
                  [1606, 237],
                  [1606, 368],
                  [1236, 368],
                ],
              },
              {
                name: "Обувь",
                id: "7e2f41ff-d54e-4254-a50c-061dbb68e6cc",
                point: [
                  [13, 237],
                  [310, 237],
                  [310, 665],
                  [13, 665],
                ],
              },
              {
                name: "Промо Зона",
                id: "",
                point: [
                  [315, 370],
                  [1605, 370],
                  [1605, 485],
                  [315, 485],
                ],
              },
              {
                name: "Игрушки для девочек",
                id: "68dccf2a-eb96-4ebd-8108-3c710a7d6ab6",
                point: [
                  [513, 487],
                  [860, 487],
                  [860, 652],
                  [513, 652],
                ],
              },
              {
                name: "Игрушки для мальчиков",
                id: "68dccf2a-eb96-4ebd-8108-3c710a7d6ab6",
                point: [
                  [1062, 486],
                  [1408, 486],
                  [1408, 652],
                  [1062, 652],
                ],
              },
              {
                name: "Одежда и обувь для новорожденных",
                id: "59b884f9-f518-463d-aef2-bafbcd08d281",
                point: [
                  [513, 656],
                  [857, 656],
                  [857, 795],
                  [717, 795],
                  [717, 832],
                  [513, 832],
                ],
              },
              {
                name: "Концтовары",
                id: "3ae21c55-f9cc-4820-9189-dc7292c4158b",
                point: [
                  [1062, 656],
                  [1408, 656],
                  [1408, 832],
                  [1062, 832],
                ],
              },
              {
                name: "Коляски и автокресла спорт и активный отдых",
                id: "285b7347-7415-4b99-b786-78d68c21dea8",
                allCategory: [
                  {
                    name: "Коляски и автокресла",
                    id: "285b7347-7415-4b99-b786-78d68c21dea8",
                  },
                  {
                    name: "Спорт и активный отдых",
                    id: "c0c717f1-6288-4d37-8252-b32cdce681d9",
                  },
                  {
                    name: "Игрушки",
                    id: "68dccf2a-eb96-4ebd-8108-3c710a7d6ab6",
                  },
                ],
                point: [
                  [1610, 237],
                  [1905, 237],
                  [1905, 824],
                  [1610, 824],
                ],
              },
            ],
          },
          {
            name: "kids",
            floor: 2,

            zone: [
              {
                name: "Детская мебель",
                id: "2842fb99-2467-40b3-afdb-52130ec79b2c",
                point: [
                  [12, 236],
                  [1906, 236],
                  [1906, 824],
                  [1611, 824],
                  [1608, 610],
                  [1409, 610],
                  [1409, 886],
                  [512, 886],
                  [512, 610],
                  [311, 610],
                  [311, 670],
                  [12, 670],
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Мебельный корпус",
        icon: "mebel",
        floors: [
          {
            name: "mebel",
            floor: 0,
            zone: [
              {
                name: "Офисная мебель, предметы интерьера",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                allCategory: [
                  {
                    name: "Офисная мебель",
                    id: "58889bd9-f77d-4d78-80bc-82c9746168d0",
                  },
                  {
                    name: "Предметы интерьера",
                    id: "fed4d9b1-89d9-46b4-92c5-05e2095561ae",
                  },
                ],
                point: [
                  [15, 237],
                  [804, 237],
                  [804, 824],
                  [470, 824],
                  [470, 640],
                  [338, 640],
                  [338, 691],
                  [235, 691],
                  [235, 822],
                  [15, 822],
                ],
              },
              {
                name: "Столовая",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                point: [
                  [1686, 469],
                  [1906, 469],
                  [1906, 824],
                  [1686, 824],
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 1,

            zone: [
              {
                name: "Текстиль",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                point: [
                  [13, 356],
                  [378, 356],
                  [378, 671],
                  [241, 671],
                  [241, 805],
                  [13, 805],
                ],
              },
              {
                name: "Клеенки корзины сушилки пластик",
                id: "0686859a-c54a-46a3-aa4e-f0b8784ececf",
                point: [
                  [386, 216],
                  [787, 216],
                  [787, 607],
                  [613, 607],
                  [613, 558],
                  [482, 558],
                  [482, 607],
                  [386, 607],
                ],
              },
              {
                name: "Бытовая химия",
                id: "360e746a-10d6-412a-a022-d2fd8b8c1e80",
                point: [
                  [465, 673],
                  [772, 673],
                  [772, 802],
                  [465, 802],
                ],
              },
              {
                name: "Арома",
                id: "790b0b5a-c584-4b0b-a718-66b45d317b41",
                point: [
                  [135, 215],
                  [241, 215],
                  [241, 350],
                  [135, 350],
                ],
              },
              {
                name: "Сувенир",
                id: "e3d1154f-3756-4348-a7a0-999b90c56929",
                point: [
                  [245, 215],
                  [382, 215],
                  [382, 350],
                  [245, 350],
                ],
              },
              {
                name: "Сковородки",
                id: "ee318362-ad72-468a-92b9-66de67bc741f",
                point: [
                  [792, 353],
                  [1132, 353],
                  [1132, 395],
                  [792, 395],
                ],
              },
              {
                name: "Кастрюли посуда для сервировки",
                id: "67168837-3e29-4fab-8a13-51bb45eefe35",
                allCategory: [
                  {
                    name: "Кастрюли",
                    id: "97e76780-3323-4c30-95c6-0c1b36f8c0d0",
                  },
                  {
                    name: "Посуда для сервировки",
                    id: "67168837-3e29-4fab-8a13-51bb45eefe35",
                  },
                ],
                point: [
                  [1135, 216],
                  [1681, 216],
                  [1681, 348],
                  [1135, 348],
                ],
              },
              {
                name: "Кухонная утварь тарелки кастрюли чайники",
                id: "531e96d5-9c30-4b4c-823d-e91792a37f07",
                allCategory: [
                  {
                    name: "Посуда для приготовления пищи",
                    id: "e1e1b734-1fd4-4d63-b34d-f894b5837ad0",
                  },
                  {
                    name: "Столовая посуда",
                    id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                  },
                  {
                    name: "Чайники",
                    id: "fef45bb6-2b0a-41f4-b8a4-ad6cb4d1281a",
                  },
                ],
                point: [
                  [1137, 353],
                  [1682, 353],
                  [1682, 605],
                  [1440, 605],
                  [1440, 560],
                  [1310, 560],
                  [1310, 605],
                  [1137, 605],
                ],
              },
              {
                name: "Хрусталь",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                point: [
                  [1686, 216],
                  [1907, 216],
                  [1907, 478],
                  [1788, 478],
                  [1788, 435],
                  [1686, 435],
                ],
              },
              {
                name: "Фарфор",
                id: "",
                point: [
                  [1686, 482],
                  [1906, 482],
                  [1906, 802],
                  [1686, 802],
                  [1686, 712],
                  [1791, 712],
                  [1791, 672],
                  [1686, 672],
                ],
              },
              {
                name: "Премиальный бутик",
                id: "",
                point: [
                  [1262, 673],
                  [1450, 673],
                  [1450, 802],
                  [1262, 802],
                ],
              },
              {
                name: "Аптека",
                id: "",
                point: [
                  [1147, 673],
                  [1257, 673],
                  [1257, 802],
                  [1147, 802],
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 2,

            zone: [
              {
                name: "Спальные гарнитуры",
                id: "ccb6adf9-e778-42a1-a0ac-dc6f6b369d5e",
                point: [
                  [1134, 238],
                  [1907, 238],
                  [1907, 822],
                  [1685, 822],
                  [1685, 685],
                  [1449, 685],
                  [1449, 822],
                  [907, 822],
                  [907, 612],
                  [836, 573],
                  [799, 573],
                  [799, 472],
                  [836, 472],
                  [902, 436],
                  [1025, 436],
                  [1025, 374],
                  [1134, 374],
                ],
              },
              // {
              //   name: "Мягкая мебель журнальные столики спальни",
              //   id: "8b335087-354d-4f7b-9223-1956b2088a5b",
              //   allCategory: [
              //     {
              //       name: "Мягкая мебель",
              //       id: "8b335087-354d-4f7b-9223-1956b2088a5b",
              //     },
              //     {
              //       name: "Спальни",
              //       id: "874ec115-a252-4b86-a881-d334a9cbcf25",
              //     },
              //     {
              //       name: "Журнальные столики",
              //       id: "61e91c57-ceea-428b-bdcd-eda54d6b3c92",
              //     },
              //   ],
              //   point: [

              //   ],
              // },
            ],
          },
          {
            name: "mebel",
            floor: 3,

            zone: [
              {
                name: "Мягкая мебель, осветительные приборы",
                id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                allCategory: [
                  {
                    name: "Мягкая мебель",
                    id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                  },
                  {
                    name: "Осветительные приборы",
                    id: "d8ba24a4-b3f1-42b8-a2bd-ee6c88237d0a",
                  },
                ],
                point: [
                  [350, 237],
                  [788, 237],
                  [788, 372],
                  [1684, 372],
                  [1684, 686],
                  [350, 686],
                ],
              },
              {
                name: "Ковры",
                id: "",
                point: [
                  [16, 374],
                  [344, 374],
                  [346, 684],
                  [16, 684],
                ],
              },
              {
                name: "Шторы",
                id: "",
                point: [
                  [16, 236],
                  [344, 236],
                  [344, 370],
                  [16, 370],
                ],
              },
              {
                name: "Шкафы",
                id: "af89a980-30a1-43dc-87e3-dbb1ccce8b09",
                point: [
                  [1137, 236],
                  [1683, 236],
                  [1683, 368],
                  [1137, 368],
                ],
              },
              {
                name: "Кровати",
                id: "324dba8c-431e-44b4-87b5-831543844040",
                point: [
                  [1686, 236],
                  [1909, 236],
                  [1909, 463],
                  [1686, 463],
                ],
              },
              {
                name: "Прихожие",
                id: "ac76f3d3-fe9c-4db5-93f9-6c23786f52b3",
                point: [
                  [1687, 466],
                  [1909, 466],
                  [1909, 685],
                  [1687, 685],
                ],
              },
              {
                name: "Комоды",
                id: "8c5e0ae3-13e2-4163-a77c-413b18ca8149",
                point: [
                  [1687, 690],
                  [1909, 690],
                  [1909, 825],
                  [1687, 825],
                ],
              },
              {
                name: "Кресла, столики, комоды",
                id: "6ce154d3-b975-40c5-8940-625d80e8c388",
                allCategory: [
                  {
                    name: "Кресла прихожие",
                    id: "6ce154d3-b975-40c5-8940-625d80e8c388",
                  },
                  {
                    name: "Комоды",
                    id: "8c5e0ae3-13e2-4163-a77c-413b18ca8149",
                  },
                ],
                point: [
                  [1015, 690],
                  [1454, 690],
                  [1454, 820],
                  [1015, 820],
                ],
              },
              {
                name: "Часы, камины, бра",
                id: "fed4d9b1-89d9-46b4-92c5-05e2095561ae",
                allCategory: [
                  {
                    name: "Камины",
                    id: "62c23491-421d-432b-919e-ffadf566793e",
                  },
                  {
                    name: "Комоды",
                    id: "8c5e0ae3-13e2-4163-a77c-413b18ca8149",
                  },
                  {
                    name: "Бра	",
                    id: "90995a16-99da-4f85-901c-1d09f352ec45",
                  },
                ],
                point: [
                  [471, 690],
                  [903, 690],
                  [903, 821],
                  [471, 821],
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 4,
            zone: [
              {
                name: "Кухонная мебель столы и стулья",
                id: "b3133753-8df7-4d84-b72c-25140dd903c7",
                allCategory: [
                  {
                    name: "Кухонная мебель",
                    id: "b3133753-8df7-4d84-b72c-25140dd903c7",
                  },
                  {
                    name: "Столы и стулья",
                    id: "9d3c3502-4fba-436f-9997-7e4df3adecfe",
                  },
                ],
                point: [
                  [15, 236],
                  [785, 236],
                  [785, 373],
                  [1135, 373],
                  [1135, 236],
                  [1450, 236],
                  [1450, 684],
                  [15, 684],
                ],
              },
              {
                name: "Мягкая мебель",
                id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                point: [
                  [1456, 236],
                  [1906, 236],
                  [1906, 824],
                  [1686, 824],
                  [1686, 687],
                  [1456, 687],
                ],
              },
              {
                name: "Кухни",
                id: "834e7a61-560f-4a09-8e29-ed725cdd3e61",
                point: [
                  [570, 690],
                  [812, 690],
                  [812, 825],
                  [570, 825],
                ],
              },
              {
                name: "Кухни столы",
                id: "fd5412c8-947a-4c11-bd75-317d3ec33713",
                point: [
                  [1014, 690],
                  [1450, 690],
                  [1450, 822],
                  [1014, 822],
                ],
              },
              {
                name: "Акссесуары для кухни",
                id: "64457d00-db85-4a84-aed7-1bb435acdcdf",
                point: [
                  [470, 690],
                  [568, 690],
                  [568, 822],
                  [470, 822],
                ],
              },
            ],
          },
          {
            name: "mebel",
            floor: 5,

            zone: [
              {
                name: "Импортная мебель",
                id: "",
                point: [
                  [15, 236],
                  [785, 236],
                  [785, 372],
                  [1135, 372],
                  [1135, 236],
                  [1905, 236],
                  [1905, 823],
                  [1685, 823],
                  [1685, 685],
                  [1450, 685],
                  [1450, 823],
                  [470, 823],
                  [470, 685],
                  [234, 685],
                  [234, 823],
                  [15, 823],
                ],
              },
            ],
          },
        ].reverse(),
      },

      {
        name: "Садовый центр",
        floors: [
          {
            name: "garden",
            floor: 0,
            id: ["ef66b2f0-d8aa-4b73-b6e1-9ae4e8c2cbf0"],
            zone: [
              {
                name: "Садовая мебель",
                id: "",
                point: [
                  [378, 236],
                  [1546, 236],
                  [1546, 825],
                  [378, 825],
                ],
              },
            ],
          },
          {
            name: "garden",
            floor: 1,
            zone: [
              {
                name: "Всё для растений товары для отдыха и полива ландшафт",
                id: "5f794cd1-33f8-448b-9bab-6da2e89a19aa",
                allCategory: [
                  {
                    name: "Всё для растений",
                    id: "5f794cd1-33f8-448b-9bab-6da2e89a19aa",
                  },
                  {
                    name: "Товары для отдыха",
                    id: "a59be78c-b332-4e20-888b-3eaa02d40bc6",
                  },
                  {
                    name: "Товары для полива",
                    id: "2af2d71c-41a1-4b45-a5a6-10f6b0e5af17",
                  },
                  {
                    name: "Ландшафт и садовый декор",
                    id: "77cb9871-127d-4ee3-933f-d0f08000e295",
                  },
                  {
                    name: "Садовая техника",
                    id: "0d5e8ec5-1a34-4ae1-a088-54be396e37e2",
                  },
                  {
                    name: "Садовый инструмент",
                    id: "3cb746b9-6ed9-4364-8db9-e650e91adea8",
                  },
                  {
                    name: "Садовый инвентарь",
                    id: "ea0a2c1a-5f5c-4d4f-add6-caa8941bfc82",
                  },
                ],
                point: [
                  [378, 237],
                  [962, 237],
                  [962, 823],
                  [378, 823],
                ],
              },
              {
                name: "Удобрение газон семена земляцветы горшоки",
                id: "ba427b61-5c73-4e9e-aad5-58f83b26a821",
                point: [
                  [968, 237],
                  [1544, 237],
                  [1544, 823],
                  [968, 823],
                ],
              },
            ],
          },
        ].reverse(),
      },
    ],

    Дербент: [
      {
        name: "Дербент",
        floors: [
          {
            name: "derbent",
            floor: 0,
            zone: [
              {
                name: "Печи",
                id: "",
                point: [],
              },
              {
                name: "Малая бытовая техника",
                id: "5b14ae51-59f1-4174-9194-06abf6416bfa",
                point: [],
              },
              {
                name: "Встраиваемая техника",
                id: "d1638c7d-fc5e-4897-95fa-0e333bb7cc22",
                point: [],
              },
              {
                name: "Климатическое оборудование",
                id: "b6a9659a-32b0-4bd8-b3d1-add9e17d5c9d",
                point: [],
              },
              {
                name: "Стиральные и сушильные машины",
                id: "933dff91-d9bb-452f-a71e-c3b716c4a96f",
                point: [],
              },
              {
                name: "Холодильники лари морозильники",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                point: [],
              },
              {
                name: "Электроника",
                id: "7e59ab9a-9932-4535-b780-860c8a6d325e",
                point: [],
              },
            ],
          },
          {
            name: "derbent",
            floor: 1,
            zone: [
              {
                name: "Детский отдел",
                id: "31b73b4b-f098-4f96-a967-233760a0e426",
                point: [],
              },
              {
                name: "Текстиль",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                point: [],
              },
              {
                name: "Красота и здоровье",
                id: "7cc46fb9-f575-4e80-b434-c93b4bb81fac",
                point: [],
              },
              {
                name: "Лабиринт",
                id: "",
                point: [],
              },
              {
                name: "Сервис-сити",
                id: "",
                point: [],
              },
              {
                name: "Сковородки",
                id: "ee318362-ad72-468a-92b9-66de67bc741f",
                point: [],
              },
              {
                name: "Нержавейка",
                id: "e1e1b734-1fd4-4d63-b34d-f894b5837ad0",
                point: [],
              },
              {
                name: "Хрусталь, стекло",
                id: "",
                point: [],
              },
              {
                name: "Фарфор",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                point: [],
              },
              {
                name: "Цветы, сувенирка",
                id: "e3d1154f-3756-4348-a7a0-999b90c56929",
                point: [],
              },
              {
                name: "Эмаль, пластик, керамика",
                id: "",
                point: [],
              },
            ],
          },
          {
            name: "derbent",
            floor: 2,
            zone: [
              {
                name: "Мягкая мебель, журнальные столики, спальни ...",
                id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                allCategory: [
                  {
                    name: "Мягкая мебель",
                    id: "8b335087-354d-4f7b-9223-1956b2088a5b",
                  },
                  {
                    name: "Журнальные столики",
                    id: "61e91c57-ceea-428b-bdcd-eda54d6b3c92",
                  },
                  {
                    name: "Спальни",
                    id: "874ec115-a252-4b86-a881-d334a9cbcf25",
                  },
                  {
                    name: "Осветительные приборы",
                    id: "d8ba24a4-b3f1-42b8-a2bd-ee6c88237d0a",
                  },
                ],
                point: [],
              },
            ],
          },
          {
            name: "derbent",
            floor: 3,
            zone: [
              {
                name: "Столовые группы, кухни",
                id: "9d3c3502-4fba-436f-9997-7e4df3adecfe",
                allCategory: [
                  {
                    name: "Столовые группы",
                    id: "9d3c3502-4fba-436f-9997-7e4df3adecfe",
                  },
                  {
                    name: "Кухни",
                    id: "834e7a61-560f-4a09-8e29-ed725cdd3e61",
                  },
                ],
                point: [],
              },
            ],
          },
        ].reverse(),
      },
    ],

    Каспийск: [
      {
        name: "Капийск КИРГУ",
        floors: [
          {
            name: "kaspiyskKirgu",
            floor: 1,
            zone: [
              {
                name: "Товары для дома, столовая посуда ...",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                point: [],
              },
              {
                name: "Крупная и малая бытовая техника",
                id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                allCategory: [
                  {
                    name: "Крупная бытовая техника",
                    id: "423f396b-f7d0-41c5-ad3f-aa5bc7980337",
                  },
                  {
                    name: "Малая бытовая техника",
                    id: "5b14ae51-59f1-4174-9194-06abf6416bfa",
                  },
                ],
                point: [],
              },
              {
                name: "Товары для ухода за одеждой и домом",
                id: "360e746a-10d6-412a-a022-d2fd8b8c1e80",
                point: [],
              },
              {
                name: "Электоника, климатическое оборудование",
                id: "7e59ab9a-9932-4535-b780-860c8a6d325e",
                allCategory: [
                  {
                    name: "Электоника",
                    id: "7e59ab9a-9932-4535-b780-860c8a6d325e",
                  },
                  {
                    name: "Климатическое оборудование",
                    id: "b6a9659a-32b0-4bd8-b3d1-add9e17d5c9d",
                  },
                ],
                point: [],
              },
            ],
          },
        ].reverse(),
      },
      {
        name: "Каспийск Домашний",
        floors: [
          {
            name: "kaspiyskHome",
            floor: 1,
            zone: [
              {
                name: "Хрусталь, стекло, химия, текстиль, пластика",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                allCategory: [
                  {
                    name: "Хрусталь",
                    id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                  },
                  {
                    name: "Химия",
                    id: "360e746a-10d6-412a-a022-d2fd8b8c1e80",
                  },
                  {
                    name: "Текстиль",
                    id: "97c06658-eab4-450c-8502-b4391fa2f359",
                  },
                  {
                    name: "Пластика",
                    id: "9d65bc7ef-55ab-4a1b-bf47-9106a1e11f7f",
                  },
                ],
                point: [],
              },
              {
                name: "Хрусталь, фарфор, текстиль, пластика",
                id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                allCategory: [
                  {
                    name: "Фарфор",
                    id: "33775e33-b557-47af-96a6-7c94df6d1ad5",
                  },
                  {
                    name: "Эмаль",
                    id: "97c06658-eab4-450c-8502-b4391fa2f359",
                  },
                  {
                    name: "Нержавейка",
                    id: "e1e1b734-1fd4-4d63-b34d-f894b5837ad0",
                  },
                ],
                point: [],
              },
            ],
          },
        ].reverse(),
      },
    ],

    Махачкала_: [
      {
        name: "Махачкала_Диджитал",
        floors: [
          {
            name: "makhachkalaDigital",
            floor: 1,
            zone: [
              {
                name: "Бытовая химия, столовые приборы, нержавейка ...",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                point: [],
              },
              {
                name: "Пластмасса, хрусталь",
                id: "97c06658-eab4-450c-8502-b4391fa2f359",
                point: [],
              },
            ],
          },
        ].reverse(),
      },
    ],
  },
};

const BUILDING = "BUILDING";

export const buildingMapReducer = (state = defaultState, action) => {
  switch (action.type) {
    default:
      return state;
  }
};
